{
  "name": "Эльвин Салманов",
  "designation": "Разработчик Frontend",
  "developer": "Разработчик",
  "about": "Обо мне",
  "projects": "Проекты",
  "experience": "Опыт",
  "education": "Образование",
  "contact": "Контакты",
  "thatsme": "Это я",
  "favouriteProjects": "Любимые проекты",
  "viewAll": "Посмотреть все",
  "latestCode": "Последний код",
  "viewGitHub": "Посмотреть GitHub",
  "viewRepository": "Посмотреть репозиторий",
  "allRightsReserved": "Все права защищены",
  "developedBy": "Разработал",
  "aboutMe": "Обо мне.",
  "aboutTitle": "Я фронтенд-разработчик, увлечённый созданием чистых и полезных веб-решений",
  "currentlyWorking": "В настоящее время работаю ",
  "currentPosition": "в Azerbaijan Airlines на должности инженера-программиста",
  "aboutContact1": "Если вам нужна помощь или есть вопросы, отправьте",
  "mail": "почту",
  "aboutContact2": "и я обязательно отвечу.",
  "aboutJobTitle": "Вакансии",
  "aboutJob1": "В настоящее время я ищу работу. Если вы считаете, что я подхожу, посмотрите мое",
  "aboutJob2": "и я был бы рад работать с вами.",
  "socialLinks": "Социальные сети",
  "about1": "Разработчик среднего уровня, специализирующийся на React, React Native и современном JavaScript.",
  "about2": "Сфокусирован на создании чистых, масштабируемых веб- и мобильных приложений с плавным пользовательским опытом.",
  "about3": "Имею опыт в архитектуре пользовательского интерфейса, оптимизации производительности и интеграции API в различных проектах.",
  "about4": "Постоянно учусь, совершенствуюсь и решаю сложные задачи на своём пути.",
  "techStack": "Технологии",
  "experienceArr": [
    {
      "title": "Инженер-программист",
      "company": "Azerbaijan Airlines",
      "year": "2022 - ПО НАСТОЯЩЕЕ ВРЕМЯ",
      "companyLink": "https://www.azal.az/en/",
      "desc": "Разрабатывал приложения на React Native для авиаперсонала, чтобы упростить рабочие процессы и улучшить коммуникацию. Автоматизировал ключевые операционные процессы и создавал JavaScript-надстройки для повышения эффективности. Поддерживал серверные системы и обеспечивал стабильное соединение между azal.az и внутренними серверами. Поддерживал критически важное программное обеспечение авиакомпании, руководил миграцией серверов в AzInTelecom и интегрировал новые IT-системы. Внедрил Grafana и Prometheus для мониторинга систем и создал подробную IT-документацию для стабильной работы."
    },
    {
      "title": "Разработчик React.js и React Native",
      "company": "Union Strategies Inc",
      "year": "2024 - 2025",
      "companyLink": "https://younified.ca/",
      "desc": "Разрабатывал мобильное приложение 'Younified' (iOS и Android) на React Native с функциями ленты публикаций, лайков, комментариев, новостей, опросов, уведомлений и редактирования профиля. Совместно создавал приложение 'Down Syndrome CA', участвуя в разработке ключевого функционала и UI-дизайна. Оптимизировал производительность, интегрировал API и улучшал сайт Younified.ca для лучшего пользовательского опыта."
    },
    {
      "title": "Старший научный сотрудник",
      "company": "ESRI — Экономический научно-исследовательский институт",
      "year": "2024 — 2025",
      "companyLink": "http://esri.gov.az/ru",
      "desc": "Осуществлял поддержку внутренних исследовательских и опытно-конструкторских проектов института. Внёс вклад в экономический анализ, оценку политики и институциональные инициативы, направленные на повышение эффективности прикладных экономических исследований."
    },
    {
      "title": "Frontend-разработчик",
      "company": "Developia Engineering Academy",
      "year": "2019 - 2021",
      "companyLink": "https://developia.az/edu/",
      "desc": "Создавал современные адаптивные интерфейсы с использованием React и превращал сложные идеи в удобный пользовательский опыт. Также преподавал JavaScript — помогая студентам понимать основную логику языка и лучшие практики. Работал с HTML, CSS, JS и jQuery, всегда стремясь к чистому и эффективному коду."
    },
    {
      "title": "React-разработчик",
      "company": "Gadimlie Studio",
      "year": "2018 - 2019",
      "companyLink": "https://www.instagram.com/gadimlie.studio/",
      "desc": "Работал над сайтом naftalanproducts.com, создавал ключевые страницы, интегрировал API, реализовал аутентификацию, поддержку нескольких языков и функционал корзины. Улучшил SEO и оптимизировал общую производительность сайта."
    }
  ],
  "educationArr": [
    {
      "title": "Магистр компьютерных наук",
      "company": "Бакинский государственный университет",
      "year": "2021 - 2023",
      "companyLink": "https://bsu.edu.az/en/welcome_to_baku_state_university",
      "desc": "Окончил магистратуру с отличием, средний балл — 85/100. Отмечен за стабильную успеваемость, аналитическое мышление и умение решать сложные технические задачи."
    },
    {
      "title": "Бакалавр компьютерных наук",
      "company": "Национальная авиационная академия Азербайджанской Республики",
      "year": "2018 - 2021",
      "companyLink": "https://naa.edu.az/",
      "desc": "Окончил бакалавриат с отличием, получив красный диплом и средний балл 94/100. Отмечен за лидерские качества и умение работать в команде."
    },
    {
      "title": "Средняя школа",
      "company": "Средняя школа №17, Баку",
      "year": "2014 - 2017",
      "companyLink": "https://bakimektebleri.edu.az/17/",
      "desc": "Изучал физику, химию и математику — окончил с отличными результатами. Активно участвовал в олимпиадах по математике и физике, занимая призовые места в Хатаинском районе Баку."
    }
  ],
  "contact1": "Свяжитесь со мной — обсудим детали.",
  "contact2": "Заполните форму, и я отвечу вам в ближайшее время.",
  "contactAddress": "Баку, Азербайджан",
  "formName": "Ваше имя",
  "formMessage": "Ваше сообщение",
  "formSubmit":"Отправить сообщение"
}